app/controllers/executives_controller.rb

SELECT "executives".* FROM "executives"
---
  def index
    @executives = Executive.all

SELECT "executives".* FROM "executives" WHERE "executives"."id" = $1 LIMIT 1  [["id", "signin"]]
---
  def show
    @executive = Executive.find(params[:id])

INSERT INTO "executives" ("created_at", "email", "exec_comments_on_self", "firstname", "is_user", "is_verified_by_staff", "is_verified_by_thirdparty", "lastname", "mobile_carrier", "mobile_tel", "office_tel", "password_digest", "prefix", "social_blog", "social_linkedin", "social_twitter", "strat_exec_constituent_type", "suffix", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @executive = Executive.new(exec_params)
      if @executive.save

SELECT "executives".* FROM "executives" WHERE "executives"."id" = $1 LIMIT 1  [["id", "FactoryGirl"]]
---
  def update
    @executive = Executive.find(params[:id])