app/controllers/organizations_controller.rb

  def index
    @organizations = Organization.all
---
SELECT "organizations".* FROM "organizations"

  def show
  	@organization = Organization.find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = $1 LIMIT 1  [["id", "home"]]

  def create
    @organization = Organization.new(org_params)
    if @organization.save
---
INSERT INTO "organizations" ("Org_Types_id", "address_street", "created_at", "description", "hq_address_city", "hq_address_state", "hq_address_zip", "hq_email", "hq_telephone", "is_verified_by_staff", "is_verified_by_thirdparty", "name", "region_headquartered_in", "sector_type", "size_employees_structured", "social_platform_dominant", "updated_at", "web_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"